In [1]:
import os

In [3]:
os.chdir("/Users/mochenyi/Desktop/T2/6001-AI_big_data")

In [5]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-2.2.3-cp39-cp39-macosx_11_0_arm64.whl (11.3 MB)
     |████████████████████████████████| 11.3 MB 6.5 MB/s eta 0:00:011
Collecting tzdata>=2022.7
  Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
     |████████████████████████████████| 346 kB 11.3 MB/s eta 0:00:01
Collecting numpy>=1.22.4
  Downloading numpy-2.0.2-cp39-cp39-macosx_14_0_arm64.whl (5.3 MB)
     |████████████████████████████████| 5.3 MB 9.7 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/mochenyi/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1
  Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
     |████████████████████████████████| 507 kB 10.7 MB/s eta 0:00:01
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)
Installing collected packages: tzdata, pytz, numpy, pandas
Successfully installed numpy-2.0.2 pandas-2.2.3 pytz-2025.1 tzdata-2025.1
WARNING: You are using pip version 21.2.4; however, version 25.0 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd

In [7]:
df=pd.read_csv("user_annual_bill_data.csv")

In [10]:
df.head()

    timestamp  income_or_spending        type   amount
0  2024-01-01                   0  Healthcare  1806.08
1  2024-01-02                   1       Bonus  2773.64
2  2024-01-03                   0   Transport  1654.65
3  2024-01-04                   0    Shopping   646.90
4  2024-01-05                   0        Rent  1792.09

In [8]:
pip install datatime

Defaulting to user installation because normal site-packages is not writeable
ERROR: Could not find a version that satisfies the requirement datatime (from versions: none)
ERROR: No matching distribution found for datatime
WARNING: You are using pip version 21.2.4; however, version 25.0 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [11]:
from datetime import datetime

df['timestamp'] = df['timestamp'].apply(lambda x: datetime.strptime(x, "%Y-%m-%d"))

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 366 entries, 0 to 365
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   timestamp           366 non-null    datetime64[ns]
 1   income_or_spending  366 non-null    int64
 2   type                366 non-null    object
 3   amount              366 non-null    float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 11.6+ KB

In [13]:
df["month"]=df["timestamp"].apply(lambda x:x.month)

In [14]:
df.head()

   timestamp  income_or_spending        type   amount  month
0 2024-01-01                   0  Healthcare  1806.08      1
1 2024-01-02                   1       Bonus  2773.64      1
2 2024-01-03                   0   Transport  1654.65      1
3 2024-01-04                   0    Shopping   646.90      1
4 2024-01-05                   0        Rent  1792.09      1

In [27]:
df_spend = df.groupby(["month","income_or_spending"],as_index=False).agg({"amount":"sum"}).query("""income_or_spending==0""")

In [30]:
df_spend

    month  income_or_spending    amount
0       1                   0  18051.13
2       2                   0  11185.71
4       3                   0  18381.90
6       4                   0   8450.79
8       5                   0  23961.32
10      6                   0  18311.95
12      7                   0  12579.75
14      8                   0  11767.20
16      9                   0  14159.78
18     10                   0  14720.93
20     11                   0  13651.07
22     12                   0  17784.44

In [32]:
df_income= df.groupby(["month","income_or_spending"],as_index=False).agg({"amount":"sum"}).query("""income_or_spending==1""")

In [33]:
df_income

    month  income_or_spending    amount
1       1                   1  40611.97
3       2                   1  41043.93
5       3                   1  49821.91
7       4                   1  67789.52
9       5                   1  36919.08
11      6                   1  34090.61
13      7                   1  22710.23
15      8                   1  41416.24
17      9                   1  34416.76
19     10                   1  39259.68
21     11                   1  51201.85
23     12                   1  40247.51

In [34]:
text_all=""
for i in range(df_income.shape[0]):
    income=df_income.iloc[i,:]
    spend=df_spend.iloc[i,:]
    text_unit=f"In month {i+1}, the spending is {spend[-1]} and the income is {income[-1]}. "
    text_all += text_unit

/var/folders/t1/6zj4fnxd7znbqp1q2xqlbpx80000gn/T/ipykernel_50730/2745202198.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  text_unit=f"In month {i+1}, the spending is {spend[-1]} and the income is {income[-1]}. "

In [35]:
text_all

'In month 1, the spending is 18051.13 and the income is 40611.97. In month 2, the spending is 11185.710000000001 and the income is 41043.93. In month 3, the spending is 18381.9 and the income is 49821.909999999996. In month 4, the spending is 8450.79 and the income is 67789.52. In month 5, the spending is 23961.32 and the income is 36919.08. In month 6, the spending is 18311.95 and the income is 34090.61. In month 7, the spending is 12579.75 and the income is 22710.23. In month 8, the spending is 11767.2 and the income is 41416.24. In month 9, the spending is 14159.78 and the income is 34416.76. In month 10, the spending is 14720.93 and the income is 39259.68. In month 11, the spending is 13651.07 and the income is 51201.85. In month 12, the spending is 17784.44 and the income is 40247.51. '

In [36]:
df_spend_type = df.groupby(["income_or_spending","type"],as_index=False).agg({"amount":"sum"}).query("""income_or_spending==0""")

In [37]:
df_spend_type

   income_or_spending           type    amount
0                   0  Entertainment  25763.37
1                   0           Food  32619.42
2                   0     Healthcare  33868.61
3                   0           Rent  35121.49
4                   0       Shopping  33705.09
5                   0      Transport  21927.99

In [38]:
df_income_type = df.groupby(["income_or_spending","type"],as_index=False).agg({"amount":"sum"}).query("""income_or_spending==1""")

In [39]:
df_income_type

   income_or_spending        type     amount
6                   1       Bonus  104274.35
7                   1        Gift  150400.44
8                   1  Investment   93412.29
9                   1      Salary  151442.21

In [41]:
spend_type_info=''
for i in range(df_income_type.shape[0]):
    info=df_income_type.iloc[i,:]
    type=f'The spending type is {info[-2]}, the amount is {info[-1]}.'
    spend_type_info+=type

/var/folders/t1/6zj4fnxd7znbqp1q2xqlbpx80000gn/T/ipykernel_50730/3871267651.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  type=f'The spending type is {info[-2]}, the amount is {info[-1]}.'

In [42]:
spend_type_info

'The spending type is Bonus, the amount is 104274.34999999999.The spending type is Gift, the amount is 150400.44.The spending type is Investment, the amount is 93412.29.The spending type is Salary, the amount is 151442.21.'